{"inkVersion":20,"root":[[{"->":"TeachersHome"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"TeachersHome":["ev",3,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria: Emily are you ready for school?","\n","^Emily: Yes mom I’ve got everything I need.","\n","^Gloria: Alright, can you make your way to the school bus? I’m running late for work.","\n","^Emily: No worries, I can make it there. Have a good day at work mom. Love you!","\n","^Gloria: Alright thanks honey, love you too. Have a good day at school.","\n",{"->":"TeachersCar"},{"#f":1}],"TeachersCar":["ev",0,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria(H): I hope Emily has an easier time with fractions soon,","\n","^Gloria(H): I might have to…","\n","ev",1,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria has found themselves in a situation in which will change their day-to-day life for ever.","\n","^They were in pain after the accident and, because of their busy schedule, finally visits a walk-in clinic.","\n",{"->":"DoctorsRoom1"},{"#f":1}],"DoctorsRoom1":["ev",2,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria(S): Hi Doctor, even though it’s been a while after the accident I still have pain in my neck.","\n","^Marsha(N): Alright, I’ll do a check up and see what I can find.","\n","^Marsha(C): Well I can’t find anything wrong with you. Was there anything else you were experiencing?","\n","^Gloria(S): The pain can come in waves, other days it hurts throughout the whole day.","\n","^Gloria(S): I’ve been losing sleep throughout the night.","\n","^Marsha(C): Huh, well there’s nothing more I can do for you. Take some Tylenol and see if it goes away.","\n","^Gloria(F): I’ve tried, and it isn’t enough. I’m worried this is something more serious.","\n","^Marsha(A): Well, like I said, I can’t find anything that would cause this pain and so there’s nothing more I can do for you.","\n","^Marsha(A): You could seek a second opinion, if you like, but they'll probably tell you the same thing.","\n",{"->":"TeachersHouse"},{"#f":1}],"TeachersHouse":[["ev",3,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria(S): I guess I could try and see a specialist, although I’m not sure I can book the time off between work and Emily. It took me long enough to go into the clinic.","\n",["ev",{"^->":"TeachersHouse.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Reach out to a specialist ",{"->":"$r","var":true},null]}],["ev",{"^->":"TeachersHouse.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Ignore symptoms, continue on to work",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TeachersHouse.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.PositiveEnding"},{"#f":5}],"c-1":["ev",{"^->":"TeachersHouse.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.NegativeEnding"},{"#f":5}]}],{"PositiveEnding":["ev",4,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Glenn(C): Hi Gloria, your file here says you’ve been having pain for the past 3 months due to a car accident. Could you tell me what symptoms you’re experiencing.","\n","^Gloria(S): Yes, since the accident I’ve had severe pain that sometimes comes in waves. Other days it’s constant and nearly unbearable.","\n","^Gloria(S): I’ve been struggling trying to sleep at night because of the pain.","\n","^Glenn(C): Alright Gloria, I want you to know that you’re not alone in this. It sounds like you’re exhibiting symptoms of chronic pain.","\n","^Glenn(C): This can occur due to events much like yours.","\n","^Glenn(C): Since you’ve been experiencing these symptoms for this long we can begin with mediation techniques however I would like to inform you that this may not go away.","\n","^Gloria(S): Thank you for taking this seriously. I feel as if there’s no one I can talk to about this and most people I do talk to don’t believe me. What options are available?","\n","^Glenn(N): Well, we can begin with medication. We’ll start with standard anti-inflammatory. We’ll have to discuss the potential side effects if taken over the long term.","\n","^Glenn(N): These can include nausea, stomach bleeding, or ulcers. If required, we can move to more advanced options such as anti-depressants or anti-psychotics, which have been found to be effective with chronic pain.","\n","^Glenn(N): These treatments are safer that opiods, which can lead to addiction and overdose.","\n","^Glenn(N): I’ll also provide you with some contact information for support groups for those with chronic pain, and family members who are affected by their family member’s limitations and treatments.","\n","^Glenn(N): With these options you may not eliminate the chronic pain however, you’ll have mediation and strategies to manage your chronic pain.","\n","^Gloria(H): Thank you doctor. I’m just hoping for a way to learn how, to manage my symptoms and improve my quality of life.","\n",{"->":".^.^.InformationAndEnding1"},{"#f":1}],"InformationAndEnding1":["ev",1,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^After Gloria was officially diagnosed with chronic pain, and having a plan for medications to be taken over the long term, Gloria contacted support groups.","\n","^Gloria knew it would be helpful to talk with others who also experience chronic pain, and to discuss strategies they use to manage their symptoms.","\n","end",{"#f":1}],"InformationAndEnding2":["ev",1,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Having been officially diagnosed with chronic pain by a specialist, and given prescriptions to help ease the pain, now Gloria could also contact a support group so they where could discuss with others things like the challenges they face, and share different techniques, strategies, and resources to improve their quality of life.","\n","end",{"#f":1}],"NegativeEnding":["ev",6,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria(S): Alright everyone, as mentioned in the previous lecture your assignment will …","\n","^Gloria(S): …your assignment will be…","\n","^Gloria(S): …will be due on…","\n","^Because Gloria's pain was dismissed by the doctor in the walk in clinic, Gloria felt they had no choice but to try to live with the pain.","\n","^While giving a course lecture online, they began to faint-they'd been unable to get enough sleep because of the pain.","\n","^Gloria had to stop the lecture to lean forward to stop the dizziness. Once the dizziness had passed, Gloria apologized to the students and cancelled the remainder of class.","\n","^After class, a couple of students were especially concerned and spoke to another faculty member whom they knew in the department, asking that they check in on Gloria’s well-being.","\n","^The faculty member told the story to two other colleagues and they mentioned what they’d heard when they were talking with Gloria.","\n",{"->":".^.^.LunchRoom"},{"#f":1}],"LunchRoom":[["ev",5,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Joseph: Hey Gloria, I heard what happened during your lecture earlier. Are you ok?","\n","^Gloria(S): Oh, since the accident I’ve had such bad pain in my neck and I haven't been able to get much sleep. I just got dizzy from being so tired.","\n","^George: You think you still have pain from that little fender bender you had? Surely the pain can't be that bad after the time that's gone by.","\n","^Julie: Gloria, I had a family member have something similar happen to them, chronic pain after an accident is not uncommon.","\n","^Julie: Have you considered talking to Accessible Employment with Human Resources, about finding supports, seeing a specialist, and working out any accommodations that might support you in your work?","\n","^Gloria(S): It’s not something I’ve given too much thought about. Between work and Emily I’m not sure I could take much time off work to deal with it.","\n","^George: Well, if you’ve got the liberty to consider it you should be fine. Just pop back some Aspirin, that’ll fix it up.","\n",["ev",{"^->":"TeachersHouse.LunchRoom.0.20.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Reach out to HR",{"->":"$r","var":true},null]}],["ev",{"^->":"TeachersHouse.LunchRoom.0.21.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Ignore symptoms, continue on to work",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TeachersHouse.LunchRoom.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.20.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.PositiveEnding2"},{"#f":5}],"c-1":["ev",{"^->":"TeachersHouse.LunchRoom.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.21.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.NegativeEnding2"},{"#f":5}]}],{"#f":1}],"NegativeEnding2":["ev",1,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^After being dismissed by the first doctor Gloria saw and so lack of access to a specialist, Gloria was forced to live with their sometimes debilitating pain. 19 % of Canadians suffer from chronic pain.","\n","^Some, like Gloria are prevented from getting necessary treatment and support to manage their pain. If you or a loved one are experiencing symptoms of chronic pain, reach out.","\n","^You can contact your primary care doctor, chronic pain specialists and support groups.","\n","^Chronic pain is identified as a disability in Canada and does entitle one to accommodations in places of work or study, insurance payment, or disability credit credit.","\n","^Due to the non-visible nature of chronic pain the system is difficult to manage, although with this effort you can find mediation techniques to live with chronic pain.","\n","end",{"#f":1}],"PositiveEnding2":["ev",6,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Sonya: Good afternoon Gloria, your file says you’re here to apply for disability insurance for a case of.... Chronic pain?","\n","^Gloria(S): Yes. I’m still experiencing pain severely enough that I can’t fully function at home or at work. I can’t even get a good night’s sleep. This has been going on for so long that I have to try again to find help.","\n","^Sonya: Alright, I’ll let you know others have come to our office with similar diagnoses and they have all found that the process to acquire accomodations is long and arduous. Would you like to proceed?","\n","^Gloria(S): I don’t know what to do. I am so tired and depressed because of the never-ending pain, and on top of that, my workload is so heavy, and I’m trying to raise a young daughter and keep a house, etc.that I know I need help.","\n","^Gloria(S): But I don’t know if I have the energy to put together everything I need to submit my request, and it seems like I never have a spare minute to look after myself.","\n","^Sonya: I can support you through putting together the documentation that is required, and then based on your doctor’s recommendations, we can put in place the right accommodations. How about you head home and take some time to think about it.","\n",{"->":".^.^.TeachersHomeEnding"},{"#f":1}],"PositiveEnding3":[["ev",6,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Gloria had decided to continue with the insurance process. The insurance company told Gloria to go see a doctor from their choosing.","\n","^Henry(C): So Gloria, your file here says you’ve been experiencing symptoms of chronic pain. Is this something you’ve seen another doctor about, and did they give you a diagnoses of chronic pain?","\n","^Gloria(S): I have seen another doctor although they didn’t diagnose me with chronic pain. They told me to take Tylenol and sent me on my way.","\n","^Henry(N): So what you’re telling me is that this is self-diagnosed? What makes you think you think that?","\n","^Gloria(S): Well from the research I’ve done it’s been about 3 months since the accident and the pain isn't letting up at all. Even the other day during one of my classes I started to faint and had to abruptly cancel the rest of the class.","\n","^Gloria(S): I’m here because there must be something real that is causing this pain. I’m not sure how much longer I can bear it.","\n","^Henry(N): Well, I’ll perform an examination and see if I find anything.","\n","^Henry(N): Well Gloria, the results show no physical damage that would cause the symptoms you’re describing. As a result there’s nothing I can do for your insurance application.","\n","^Gloria(F): I don’t understand, do you not believe me? Is there anything else I can do?","\n","^Henry(N): I'm afraid there’s nothing else I can do. You’re entitled to a second opinion, and if they believe your accident might have resulted in chronic pain, they might refer you to a specialist.","\n","^Gloria(S): ...Okay, I’ll have to think about it.","\n",["ev",{"^->":"TeachersHouse.PositiveEnding3.0.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Seek out specialist for second opinion",{"->":"$r","var":true},null]}],["ev",{"^->":"TeachersHouse.PositiveEnding3.0.29.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Ignore symptoms",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TeachersHouse.PositiveEnding3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.28.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.PositiveEnding4"},{"#f":5}],"c-1":["ev",{"^->":"TeachersHouse.PositiveEnding3.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.29.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.NegativeEnding2"},{"#f":5}]}],{"#f":1}],"PositiveEnding4":["ev",2,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Glenn: Hi Gloria, your file here says you’ve been having pain for the past 3 months due to a car accident. Could you tell me what symptoms you’re experiencing.","\n","^Gloria: Yes, since the accident I’ve had severe pain that sometimes comes in waves, other days it’s constant and near unbearable. I’ve been struggling to get much sleep at night, or doing things like going grocery shopping or even playing with my daughter.","\n","^Glenn: Alright Gloria, I want you to know that you’re not alone in this. It sounds like you’re exhibiting symptoms of chronic pain. This can occur due to events much like yours.","\n","^Glenn: Since you’ve been experiencing these symptoms for so long, we can begin with mediation techniques however I would like to inform you that this may not go away.","\n","^Gloria: Thank you for taking this seriously. I feel as if there’s no one I can talk to about this and most people I do try to talk to don’t believe me. What options are available?","\n","^Glenn: Well we can begin with medication, we’ll start with standard anti-inflammatories. We’ll have to discuss the potential side effects if taken over the long term.","\n","^Glenn: These can include nausea, stomach bleeding, or ulcers. If required, we can move to more advanced options such as anti-depressants or anti-psychotics, which have actually been found to be effective with chronic pain.","\n","^Glenn: These treatments are safer that opioids which can lead to unintentional addiction and overdose.","\n","^Glenn: I’ll also provide you with some contact information for support groups for those with chronic pain, and family members who are affected by their family member’s limitations and treatments.","\n","^Glenn: With these options you may not eliminate the chronic pain however, you’ll have mediation and strategies to manage your chronic pain.","\n","^Gloria: Thank you doctor! I’m so hopeful that I’ll find a way to manage the pain and be able to do some of the things I used to do before the accident.","\n",{"->":".^.^.InformationAndEnding2"},{"#f":1}],"TeachersHomeEnding":[["ev",3,{"x()":"changeBackground","exArgs":1},"pop","/ev","\n","^Emily(S): Hey mom, how did that meeting with that lady from work go? Are they going to be able to help you?","\n","^Gloria(S): Well honey, they gave me a choice.","\n","^Emily(H): Well Mum, I know this has been really hard for you, but hopefully this all works out. I’m here for you!","\n",["ev",{"^->":"TeachersHouse.TeachersHomeEnding.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^Continue with insurance",{"->":"$r","var":true},null]}],["ev",{"^->":"TeachersHouse.TeachersHomeEnding.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^Ignore symptoms",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"TeachersHouse.TeachersHomeEnding.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.PositiveEnding3"},{"#f":5}],"c-1":["ev",{"^->":"TeachersHouse.TeachersHomeEnding.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.NegativeEnding2"},{"#f":5}]}],{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}