{"inkVersion":20,"root":[[{"->":"wakeUp"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"wakeUp":["^Allie: I wake up to the deafening sound of my alarm clock.","\n","^After how tough last night was, I can’t even fathom how I’m going to make it to class today.","\n","^Remembering that I have a test today, I begrudgingly get out of bed.","\n","^As I open my closet door, I accidentally bump my arm on my nightstand. The pain causes me to inhale sharply.","\n","^The dried gouges on my arm still sting from the night before. There is no way they could be hidden under a shirt.","\n","^I guess I will have to wear my jacket to class today.","\n","^I have been trying to control my opioid use for a number of years to know avail.","\n","^Running out of options has led me to pain. Cutting is my only escape.","\n","^The numb feeling that takes over my body is preferable to the pain I would feel otherwise.","\n",{"->":".^.schoolHallway"},{"schoolHallway":[["^Later that day...","\n","^Allie(J): I had made it to school on the bus without anyone noticing the scars.","\n","^But that was the easy part. Everyone on the bus wears their coat.","\n","^I walk briskly down the hall, hoping to get to class as quickly as possible without drawing attention to myself.","\n","^I need to keep moving to avoid being marked as tardy. Nothing draws more attention to a person than walking into class late.","\n","^As I turn the corner of the second floor, I find myself face to face with one of the school’s vice principals.","\n","^My heart sinks in my chest. I have grown to distrust the school administration, and I’ve got the feeling that they don’t trust me either.","\n","^I try to sneak by him, but my attempt was futile.","\n","^VP: Stop right there, young lady!","\n","^My heels screeched on the hallway floor.","\n","^VP: Where are you headed in such a hurry?","\n","^Allie: I’m heading to my organic chemistry class, sir. I do not want to be late.","\n","^VP: Is being in a hurry the reason you forgot to remove your jacket?","\n","^VP: I’m assuming you’re aware that wearing coats in class is prohibited.","\n","^A bead of sweat runs down my forehead. I cannot take off my jacket.","\n","^Allie: With all due respect, I am going to be late for class.","\n","^VP: I must ask that you take off your coat.","\n","^Allie: I can’t! I mean, I don’t want to!","\n","^The VP gives me a quizzical look.","\n",["ev",{"^->":"wakeUp.schoolHallway.0.38.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^VP: (Give her a chance to explain why she is refusing)",{"->":"$r","var":true},null]}],["ev",{"^->":"wakeUp.schoolHallway.0.39.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":2},{"s":["^VP: (Continue demanding her to remove her coat)",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"wakeUp.schoolHallway.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.38.s"},[{"#n":"$r2"}],"\n",{"->":"wakeUp.askWhy"},{"#f":5}],"c-1":["ev",{"^->":"wakeUp.schoolHallway.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.39.s"},[{"#n":"$r2"}],"\n",{"->":"wakeUp.continueDemanding"},{"#f":5}]}],{"#f":1}],"askWhy":["^After a short pause, the vice principal’s expression changes. His next question is asked in a softer tone.","\n","^VP: Is there a reason why you feel uncomfortable taking off your coat before class?","\n","^VP: It is okay to tell me.","\n","^For a second I consider it, but quickly come to my senses.","\n","^If he sees the cuts, what if he calls the police? What if he finds out about my opioid use?","\n","^I worry that I’d be suspended. I’d be judged. People would see me as a failure.","\n","^I cannot have him telling my family. This is my burden to bear.","\n","^I sleeplessly come up with a lie.","\n","^Allie: The air conditioning makes the classroom a bit chilly, and my sweaters are still packed up for the summer.","\n","^I could tell from his expression that he doesn’t buy it, but he still seems to want to help. After a long sigh, I decide to give him something closer to the truth.","\n","^Allie: I have not been doing well emotionally. I need the comfort of my coat.","\n","^VP: If that’s the case, I’m not going to pressure you to give me details.","\n","^VP: But I encourage you to have a chat with the guidance counsellor.","\n","^VP: She can help you through whatever you’re going through, and I can let your professor know that your absence is excused.","\n","^VP: That is, if you want to talk to her.","\n","^Exasperated and slightly relieved, I figure I might as well take him up on his offer.","\n","^I could probably use the help anyway.","\n","^Allie: Yeah, I think I’ll do that.","\n","^VP: Great, come this way.","\n",{"->":".^.^.counsellorEnding"},{"#f":1}],"counsellorEnding":["^The guidance counsellor was very approachable and easy to talk to.","\n","^After talking with her for a while, I finally mustered the courage to tell her about my substance use.","\n","^I confided in her that I felt like I was hopelessly trapped in my habits.","\n","^Throughout the meeting, I was allowed to keep my coat on. I never had to reveal my arms.","\n","^She referred me to a substance use disorder program for youth and offered to make regular appointments to check up on me.","\n","^My recovery journey will take time, but at least I know I am now on the right track.","\n","end",{"#f":1}],"continueDemanding":["^The vice principal’s look hardens. I prepare for the worst.","\n","^VP: I didn’t ask whether you wanted to take off your coat. That was an order.","\n","^He crosses his arms and looks at me sternly. I continue to not move.","\n","^VP: Fine, you can try pleading your case to the principal. Come with me.","\n","^As we begin walking towards the principal’s office, I feel as though I’m being taken on a death walk.","\n","^The principal will force me to take off my coat. He’s never been very understanding before, I doubt he’s going to start now.","\n","^If he sees the cuts, will he call the police? What if he finds out about my opioid use?","\n","^I bet I’d be suspended. I’d be judged. People would see me as a failure.","\n","^I cannot have him telling my family. This is my burden to bear.","\n","^As we pass by the school’s front entrance, I decide to make a break for it.","\n","^VP: Where are you going? Allie!? Come back here!","\n","^I keep running and don’t look back.","\n",{"->":".^.^.returnToBedroom"},{"#f":1}],"returnToBedroom":["^I arrived at home in tears and ran up the stairs to my room.","\n","^Ashamed, I took a razor blade and began cutting words of self-hatred into my chest.","\n","^I felt like a hopeless failure.","\n","^To cope with the pain, I began taking Tylenol. Too much Tylenol.","\n","^I began to feel woozy but couldn’t stop.","\n","^In my flurry of emotions, I accidentally neglected to close the door. When my father arrived home from work, he found me passed out on my bedroom floor, overdosed on Tylenol.","\n","^Tylenol is toxic and can potentially cause permanent liver damage.","\n","^He immediately called 911 and I was rushed into treatment.","\n",{"->":".^.^.hospital"},{"#f":1}],"hospital":["^At the hospital, I was hooked up to an IV and given medication to protect me from liver damage.","\n","^My body refused the treatment and my whole body began to swell. I went into anaphylactic shock.","\n","^After days in the ICU, I was finally well enough to go home again, but not before being cleared by a mental health practitioner.","\n","^The meeting with the practitioner went quickly. After being asked a few questions, I was handed a self-help book and told to read it. I was cleared to go home later that day.","\n",{"->":".^.^.endingBedroom"},{"#f":1}],"endingBedroom":["^Flipping through the self-help book, I realized that most of the information was too general to apply to my situation. The book no doubt had some good advice, but it was of little help to me.","\n","^I felt as though my issues had been dismissed.","\n","^I am tired of feeling worthless. I want to feel like I am worthy of receiving help without being shamed for my substance use, but it feels as though I’m always dismissed.","\n","^I worry that this whole situation could repeat itself. I still cannot control my substance use. I still have to hide it from others.","\n","^It is hard to remain hopeful that anything will ever change.","\n","end",{"#f":1}],"#f":1}],"#f":1}],"listDefs":{}}