{"inkVersion":20,"root":[["^After a short pause, the vice principal’s expression changes. His next question is asked in a softer tone.","\n","^VP: Is there a reason why you feel uncomfortable taking off your coat before class?","\n","^VP: It is okay to tell me.","\n","^For a second I consider it, but quickly come to my senses.","\n","^....If he sees the cuts, what if he calls the police? What if he finds out about my opioid use?","\n","^....I worry that I’d be suspended. I’d be judged. People would see me as a failure.","\n","^....I cannot have him telling my family. This is my burden to bear.","\n","^....I sleeplessly come up with a lie.","\n","^Allie: The air conditioning makes the classroom a bit chilly, and my sweaters are still packed up for the summer.","\n","^....I could tell from his expression that he doesn’t buy it, but he still seems to want to help. After a long sigh, I decide to give him something closer to the truth.","\n","^Allie: I have not been doing well emotionally. I need the comfort of my coat.","\n","^VP: If that’s the case, I’m not going to pressure you to give me details.","\n","^VP: But I encourage you to have a chat with the guidance counsellor.","\n","^VP: She can help you through whatever you’re going through, and I can let your professor know that your absence is excused.","\n","^VP: That is, if you want to talk to her.","\n","^Exasperated and slightly relieved, I figure I might as well take him up on his offer.","\n","^I could probably use the help anyway.","\n","^Allie: Yeah, I think I’ll do that.","\n","^VP: Great, come this way.","\n",{"->":"counsellorEnding"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"counsellorEnding":["^The guidance counsellor was very approachable and easy to talk to.","\n","^After talking with her for a while, I finally mustered the courage to tell her about my substance use.","\n","^I confided in her that I felt like I was hopelessly trapped in my habits.","\n","^Throughout the meeting, I was allowed to keep my coat on. I never had to reveal my arms.","\n","^She referred me to a substance use disorder program for youth and offered to make regular appointments to check up on me.","\n","^My recovery journey will take time, but at least I know I am now on the right track.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}